In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [39]:
df=pd.read_csv(r"F:\ML\test_NAN4.csv")

In [40]:
df.head()

   country   age   salary purchased
0   france  28.0  28000.0        No
1    spain  35.0  35000.0       Yes
2  germany  71.0  71000.0       Yes
3   france   NaN  25000.0       Yes
4    spain  28.0  28000.0       Yes

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    9 non-null      object
 1   age        8 non-null      float64
 2   salary     8 non-null      float64
 3   purchased  9 non-null      object
dtypes: float64(2), object(2)
memory usage: 416.0+ bytes

In [42]:
y=df.iloc[:,3].values

In [43]:
x=df.iloc[:,:-1].values

In [44]:
df.dtypes

country       object
age          float64
salary       float64
purchased     object
dtype: object

In [45]:
print(x)

[['france' 28.0 28000.0]
 ['spain' 35.0 35000.0]
 ['germany' 71.0 71000.0]
 ['france' nan 25000.0]
 ['spain' 28.0 28000.0]
 ['germany' 35.0 35000.0]
 ['france' 71.0 nan]
 ['spain' 55.0 55000.0]
 ['germany' 60.0 60000.0]]

In [46]:
print(y)

['No' 'Yes' 'Yes' 'Yes' 'Yes' 'No' 'No' 'Yes' 'Yes']

In [47]:
df.isnull().sum()

country      0
age          1
salary       1
purchased    0
dtype: int64

# dropna

In [49]:
df2=df.copy()

In [50]:
df2.dropna(inplace=True)

In [51]:
df2

   country   age   salary purchased
0   france  28.0  28000.0        No
1    spain  35.0  35000.0       Yes
2  germany  71.0  71000.0       Yes
4    spain  28.0  28000.0       Yes
5  germany  35.0  35000.0        No
7    spain  55.0  55000.0       Yes
8  germany  60.0  60000.0       Yes

In [52]:
df2.shape

(7, 4)

# fillna

In [53]:
df3=df.copy()

In [54]:
df3.fillna(df3.mean())

C:\Users\Admin\AppData\Local\Temp\ipykernel_21792\835967004.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df3.fillna(df3.mean())

   country     age   salary purchased
0   france  28.000  28000.0        No
1    spain  35.000  35000.0       Yes
2  germany  71.000  71000.0       Yes
3   france  47.875  25000.0       Yes
4    spain  28.000  28000.0       Yes
5  germany  35.000  35000.0        No
6   france  71.000  42125.0        No
7    spain  55.000  55000.0       Yes
8  germany  60.000  60000.0       Yes

In [55]:
df3.fillna(df3.median())

C:\Users\Admin\AppData\Local\Temp\ipykernel_21792\3606011323.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df3.fillna(df3.median())

   country   age   salary purchased
0   france  28.0  28000.0        No
1    spain  35.0  35000.0       Yes
2  germany  71.0  71000.0       Yes
3   france  45.0  25000.0       Yes
4    spain  28.0  28000.0       Yes
5  germany  35.0  35000.0        No
6   france  71.0  35000.0        No
7    spain  55.0  55000.0       Yes
8  germany  60.0  60000.0       Yes

# sklearn

In [59]:
from sklearn.impute import SimpleImputer
imputer=SimpleImputer (missing_values=np.nan,strategy='mean')
imputer.fit(x[:,1:3])
x[:,1:3]=imputer.transform(x[:,1:3])

In [60]:
print(x)

[['france' 28.0 28000.0]
 ['spain' 35.0 35000.0]
 ['germany' 71.0 71000.0]
 ['france' 47.875 25000.0]
 ['spain' 28.0 28000.0]
 ['germany' 35.0 35000.0]
 ['france' 71.0 42125.0]
 ['spain' 55.0 55000.0]
 ['germany' 60.0 60000.0]]

# one hot encoding

In [63]:
pd.get_dummies(df,columns=["country","purchased"])

,age,salary,country_france,country_germany,country_spain,purchased_No,purchased_Yes
0,28.0,28000.0,1,0,0,1,0
1,35.0,35000.0,0,0,1,0,1
2,71.0,71000.0,0,1,0,0,1
3,NaN,25000.0,1,0,0,0,1
4,28.0,28000.0,0,0,1,0,1
5,35.0,35000.0,0,1,0,1,0
6,71.0,NaN,1,0,0,1,0
7,55.0,55000.0,0,0,1,0,1
8,60.0,60000.0,0,1,0,0,1

In [65]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
y=le.fit_transform(y)
y

array([0, 1, 1, 1, 1, 0, 0, 1, 1], dtype=int64)

In [ ]:
#................................................Feature Scaling................................................................
from sklear.preprocessing import StandardScalar
operator=StandardScalar()
X_train=operator.fit_transform(X_train)
X_test=operator.transform(X_test)